<!-- placeholder-1 -->
```fish
terraform plan -chdir=. -refresh=true
```
<!-- placeholder-2 -->

<details open><summary>Diff of 2 changes.</summary>

```diff
! github_repository.p_repository will be updated in-place
+ time_rotating.rotate_tailnet_key will be created
```
</details>
<!-- placeholder-3 -->
<details><summary>Plan: 1 to add, 1 to change, 0 to destroy.</br>

<!-- placeholder-4 -->
###### By @b- at 2025-07-14T04:24:27Z [(view log)](https://github.com/perchnet/p/actions/runs/16257913469/job/45897460511#step:11:1).
</summary>

```hcl

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # github_repository.p_repository will be updated in-place
  ~ resource "github_repository" "p_repository" {
      ~ delete_branch_on_merge      = false -> true
      + description                 = "bri's homelab terraform monorepo"
        id                          = "p"
        name                        = "p"
        # (34 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # time_rotating.rotate_tailnet_key will be created
  + resource "time_rotating" "rotate_tailnet_key" {
      + day              = (known after apply)
      + hour             = (known after apply)
      + id               = (known after apply)
      + minute           = (known after apply)
      + month            = (known after apply)
      + rfc3339          = (known after apply)
      + rotation_minutes = 60
      + rotation_rfc3339 = (known after apply)
      + second           = (known after apply)
      + unix             = (known after apply)
      + year             = (known after apply)
    }

Plan: 1 to add, 1 to change, 0 to destroy.
```
</details>
<!-- placeholder-5 -->
<!-- terraform-34-3eee8c84341b95e00d4d4dd1307a8268.tfplan -->
<!-- placeholder-6 -->